{
  "reviews": [
    {
      "name": "Dr Sangeeta Paul Budhiraja",
      "designation": "Philanthropist and Educationist",
      "company": "Managing Trustee: 'Parivartan - The Change', Director - Mantrana Solutions Pvt Ltd",
      "review": "Exceptional Printing Services by Magnum Custom Publishing\n\nI entrusted Magnum Custom Publishing with the hardcover printing of my doctoral book, A Study of Human Emotions, and the outcome exceeded all expectations. As an academic, I was deeply impressed by their impeccable production quality, attention to detail, and commitment to preserving the integrity and aesthetics of a scholarly work.\n\nThe book exemplifies their professionalism, responsiveness, and respect for authorial vision. It made the entire experience seamless and gratifying. The final product reflects both intellectual seriousness and refined craftsmanship.\n\nMagnum stands out as a dependable choice for authors who value quality and care in their printed work. I extend my sincere appreciation and wholehearted recommendation."
    },
    {
      "name": "Dr. B. D. Bhushan",
      "designation": "Retired Professor, Hansraj College, University of Delhi",
      "company": "Author of 'The Struggles of a Bonsai'",
      "review": "Grateful to Magnum Custom Publishing for Honouring My Journey\n\nAs a retired professor from Hansraj College, University of Delhi, penning my autobiography The Struggles of a Bonsai was a deeply personal and reflective endeavor. I am truly grateful to Magnum Publishing for handling its publication with such professionalism, sensitivity, and care.\n\nThough I approached them primarily for printing services, their prompt communication, high production standards, and sincere respect for my voice as an author made the experience thoroughly satisfying. This edition of my book stands as a beautiful testament to their craftsmanship and dedication.\n\nMagnum Publishing has my heartfelt appreciation for preserving the spirit of my journey — not just through words, but through the quality with which they brought it to life. I recommend them warmly to fellow writers seeking a reliable and respectful publishing partner."
    },
    {
      "name": "Neharika Malhotra",
      "designation": "Digital Marketing Manager, (EMEA) Europe Middle East and Africa",
      "company": "Royal Enfield, London, UK",
      "review": "I had reached out to Mr. Passi a few years back when preparing my applications to pursue an MBA in the US. Having given the bare minimum effort on my CV during the 4 years working in the corporate world, my CV needed a refresh in terms of presentation, format and content. Mr. Passi took on the task of revamping my CV with me, starting with a full understanding of my professional background and my future aspirations. Apart from best practices with regards to format, he worked with me on the content, highlighting my strengths and building out a concise and informative resume. Furthermore, my resume aligned with the needs of the industry I was hoping to work in as well. I received admission into my school of choice and have since worked on the revised resume as a starting point for all job applications as well."
    },
    {
      "name": "Sharad Mittal",
      "designation": "Founder",
      "company": "Tanay Technocrats",
      "review": "Arvind knows his work well. Is very quality conscious and believes in honoring his commitment. Easy to reach and gives sound advise to improve on what is offered to him for work. We found him to be reasonable when it comes to pricing."
    },
    {
      "name": "Vineet Arora",
      "designation": "Managing Director",
      "company": "Crayons Advertising Pvt Ltd",
      "review": "While publishing both my books 'Click' and 'Wow', I had approached Magnum Custom Publishing. They exceeded my expectations in every way!\n\nThe editing process was meticulous, and their keen eye for detail polished my manuscript into a refined work. The layout and design of the book were personally overseen by Mr Arvind Passi, MD of Magum Publishing, making it a joy to hold and read.\n\nTheir professionalism, communication, and dedication to quality are truly commendable. I'm grateful for their expertise and thrilled to have worked with them.\n\nHighly recommended for any author seeking a publishing partner who truly cares about the final product."
    },
    {
      "name": "Ajayya Gulati",
      "designation": "",
      "company": "",
      "review": "Arvind Passi was a great help in delivering a high quality book. His knowledge and experience of book layouts and printing sped up the processes to complete in quick time. Overall, a very pleasant and fulfilling interaction... Thank you!"
    },
    {
      "name": "Mudit Marda",
      "designation": "Blockchain technology entrepreneur",
      "company": "",
      "review": "I recently worked with Arvind ji to print a coffee table book, and his guidance throughout the entire design and printing process was invaluable—especially since it was my first time. He went above and beyond to accommodate my special requests, worked diligently to meet the timelines I provided, and delivered a final product that exceeded my expectations in quality and presentation. His clear communication, upfront pricing, and utmost professionalism made the journey stress-free. His meticulous attention to detail ensured every design element was perfect. I’m already collaborating with him on a new project and would wholeheartedly recommend his publishing services to anyone seeking a seamless, high-quality experience"
    }
  ]
}
